#include <stdio.h>
#include <math.h>

int main() {
    double a, b, c;
    double s, r;

    // Введення довжин сторін трикутника та перевірка на коректність
    do {
        printf("Введіть довжини сторін трикутника (a, b, c): ");
        scanf("%lf %lf %lf", &a, &b, &c);

        if (a <= 0 || b <= 0 || c <= 0) {
            printf("Довжина сторін трикутника має бути додатнім числом.\n");
        }
    } while (a <= 0 || b <= 0 || c <= 0);

    // Обчислення півпериметра трикутника
    s = (a + b + c) / 2.0;

    // Обчислення радіуса вписаного в трикутник кола
    r = sqrt(((s - a) * (s - b) * (s - c)) / s);

    // Виведення результату
    printf("Радіус вписаного в трикутник кола: %lf\n", r);

    return 0;
}
